/*
SQLyog Community v11.13 (64 bit)
MySQL - 5.6.25 : Database - base_pro
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`base_pro` /*!40100 DEFAULT CHARACTER SET latin1 */;

USE `base_pro`;

/*Table structure for table `t_code` */

DROP TABLE IF EXISTS `t_code`;

CREATE TABLE `t_code` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `code_type` varchar(50) DEFAULT NULL,
  `code_name` varchar(50) NOT NULL,
  `code_key` varchar(50) DEFAULT NULL,
  `code_sort` varchar(50) DEFAULT '0',
  `pid` int(11) DEFAULT NULL,
  `is_using` int(2) DEFAULT '1' COMMENT '用于区分确认订单规则启用',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=34 DEFAULT CHARSET=utf8;

/*Data for the table `t_code` */

insert  into `t_code`(`id`,`code_type`,`code_name`,`code_key`,`code_sort`,`pid`,`is_using`) values (4,'USER_SEX','用户性别',NULL,'0',NULL,1),(5,'USER_SEX','男','1','0',4,1),(6,'USER_SEX','女','2','1',4,1),(7,'USER_STATE','用户状态',NULL,'0',NULL,1),(8,'USER_STATE','启用','1','0',7,1),(9,'USER_STATE','禁用','3','2',7,1),(10,'USER_STATE','审核','2','1',7,1),(11,'USER_STATUS','用户类型',NULL,'0',NULL,1),(12,'USER_STATUS','录入','1','0',11,1),(13,'USER_STATUS','配送','2','1',11,1),(14,'USER_STATUS','管理员','100','2',11,1),(15,'ORDER_STATUS','订单状态',NULL,'0',NULL,1),(16,'ORDER_STATUS','取消','-1','0',15,1),(17,'ORDER_STATUS','录入','1','1',15,1),(18,'ORDER_STATUS','取货','2','2',15,1),(19,'ORDER_STATUS','配送','3','3',15,1),(20,'ORDER_STATUS','确认','4','4',15,1),(21,'ORDER_STATUS','异常','5','5',15,1),(26,'ORDER_STATUS','小票','10','6',15,1),(27,'PAYMENT_RULE','劳务薪酬规则',NULL,NULL,NULL,NULL),(28,'PAYMENT_RULE','比例','0.5','0',27,2),(29,'PAYMENT_RULE','金额','4','1',27,1),(30,'SHARE_RULE','分红规则',NULL,NULL,NULL,NULL),(31,'SHARE_RULE','配送员获益比','0.5','0',30,1),(32,'SHARE_ACCOUNT','分红帐号',NULL,NULL,NULL,NULL),(33,'SHARE_ACCOUNT','管理员','admin','0',32,1);

/*Table structure for table `t_common_region` */

DROP TABLE IF EXISTS `t_common_region`;

CREATE TABLE `t_common_region` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL DEFAULT '' COMMENT '名称',
  `pid` int(11) unsigned NOT NULL DEFAULT '0',
  `visable` int(1) unsigned NOT NULL DEFAULT '0' COMMENT '是否可见',
  PRIMARY KEY (`id`),
  KEY `upid` (`pid`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=45052 DEFAULT CHARSET=utf8;

/*Data for the table `t_common_region` */

insert  into `t_common_region`(`id`,`name`,`pid`,`visable`) values (1,'北京市',0,1),(2,'天津市',0,1),(3,'河北省',0,1),(4,'山西省',0,1),(5,'内蒙古自治区',0,1),(6,'辽宁省',0,1),(7,'吉林省',0,1),(8,'黑龙江省',0,1),(9,'上海市',0,1),(10,'江苏省',0,1),(11,'浙江省',0,1),(12,'安徽省',0,1),(13,'福建省',0,1),(14,'江西省',0,1),(15,'山东省',0,1),(16,'河南省',0,1),(17,'湖北省',0,1),(18,'湖南省',0,1),(19,'广东省',0,1),(20,'广西壮族自治区',0,1),(21,'海南省',0,1),(22,'重庆市',0,1),(23,'四川省',0,1),(24,'贵州省',0,1),(25,'云南省',0,1),(26,'西藏自治区',0,1),(27,'陕西省',0,1),(28,'甘肃省',0,1),(29,'青海省',0,1),(30,'宁夏回族自治区',0,1),(31,'新疆维吾尔自治区',0,1),(32,'台湾省',0,1),(33,'香港特别行政区',0,1),(34,'澳门特别行政区',0,1),(35,'海外',0,1),(36,'其他',0,1),(37,'东城区',1,1),(38,'西城区',1,1),(39,'崇文区',1,1),(40,'宣武区',1,1),(41,'朝阳区',1,1),(42,'丰台区',1,1),(43,'石景山区',1,1),(44,'海淀区',1,1),(45,'门头沟区',1,1),(46,'房山区',1,1),(47,'通州区',1,1),(48,'顺义区',1,1),(49,'昌平区',1,1),(50,'大兴区',1,1),(51,'怀柔区',1,1),(52,'平谷区',1,1),(53,'密云县',1,1),(54,'延庆县',1,1),(55,'和平区',2,1),(56,'河东区',2,1),(57,'河西区',2,1),(58,'南开区',2,1),(59,'河北区',2,1),(60,'红桥区',2,1),(61,'塘沽区',2,1),(62,'汉沽区',2,1),(63,'大港区',2,1),(64,'东丽区',2,1),(65,'西青区',2,1),(66,'津南区',2,1),(67,'北辰区',2,1),(68,'武清区',2,1),(69,'宝坻区',2,1),(70,'宁河县',2,1),(71,'静海县',2,1),(72,'蓟县',2,1),(73,'石家庄市',3,1),(74,'唐山市',3,1),(75,'秦皇岛市',3,1),(76,'邯郸市',3,1),(77,'邢台市',3,1),(78,'保定市',3,1),(79,'张家口市',3,1),(80,'承德市',3,1),(81,'衡水市',3,1),(82,'廊坊市',3,1),(83,'沧州市',3,1),(84,'太原市',4,1),(85,'大同市',4,1),(86,'阳泉市',4,1),(87,'长治市',4,1),(88,'晋城市',4,1),(89,'朔州市',4,1),(90,'晋中市',4,1),(91,'运城市',4,1),(92,'忻州市',4,1),(93,'临汾市',4,1),(94,'吕梁市',4,1),(95,'呼和浩特市',5,1),(96,'包头市',5,1),(97,'乌海市',5,1),(98,'赤峰市',5,1),(99,'通辽市',5,1),(100,'鄂尔多斯市',5,1),(101,'呼伦贝尔市',5,1),(102,'巴彦淖尔市',5,1),(103,'乌兰察布市',5,1),(104,'兴安盟',5,1),(105,'锡林郭勒盟',5,1),(106,'阿拉善盟',5,1),(107,'沈阳市',6,1),(108,'大连市',6,1),(109,'鞍山市',6,1),(110,'抚顺市',6,1),(111,'本溪市',6,1),(112,'丹东市',6,1),(113,'锦州市',6,1),(114,'营口市',6,1),(115,'阜新市',6,1),(116,'辽阳市',6,1),(117,'盘锦市',6,1),(118,'铁岭市',6,1),(119,'朝阳市',6,1),(120,'葫芦岛市',6,1),(121,'长春市',7,1),(122,'吉林市',7,1),(123,'四平市',7,1),(124,'辽源市',7,1),(125,'通化市',7,1),(126,'白山市',7,1),(127,'松原市',7,1),(128,'白城市',7,1),(129,'延边朝鲜族自治州',7,1),(130,'哈尔滨市',8,1),(131,'齐齐哈尔市',8,1),(132,'鸡西市',8,1),(133,'鹤岗市',8,1),(134,'双鸭山市',8,1),(135,'大庆市',8,1),(136,'伊春市',8,1),(137,'佳木斯市',8,1),(138,'七台河市',8,1),(139,'牡丹江市',8,1),(140,'黑河市',8,1),(141,'绥化市',8,1),(142,'大兴安岭地区',8,1),(143,'黄浦区',9,1),(144,'卢湾区',9,1),(145,'徐汇区',9,1),(146,'长宁区',9,1),(147,'静安区',9,1),(148,'普陀区',9,1),(149,'闸北区',9,1),(150,'虹口区',9,1),(151,'杨浦区',9,1),(152,'闵行区',9,1),(153,'宝山区',9,1),(154,'嘉定区',9,1),(155,'浦东新区',9,1),(156,'金山区',9,1),(157,'松江区',9,1),(158,'青浦区',9,1),(159,'南汇区',9,1),(160,'奉贤区',9,1),(161,'崇明县',9,1),(162,'南京市',10,1),(163,'无锡市',10,1),(164,'徐州市',10,1),(165,'常州市',10,1),(166,'苏州市',10,1),(167,'南通市',10,1),(168,'连云港市',10,1),(169,'淮安市',10,1),(170,'盐城市',10,1),(171,'扬州市',10,1),(172,'镇江市',10,1),(173,'泰州市',10,1),(174,'宿迁市',10,1),(175,'杭州市',11,1),(176,'宁波市',11,1),(177,'温州市',11,1),(178,'嘉兴市',11,1),(179,'湖州市',11,1),(180,'绍兴市',11,1),(181,'舟山市',11,1),(182,'衢州市',11,1),(183,'金华市',11,1),(184,'台州市',11,1),(185,'丽水市',11,1),(186,'合肥市',12,1),(187,'芜湖市',12,1),(188,'蚌埠市',12,1),(189,'淮南市',12,1),(190,'马鞍山市',12,1),(191,'淮北市',12,1),(192,'铜陵市',12,1),(193,'安庆市',12,1),(194,'黄山市',12,1),(195,'滁州市',12,1),(196,'阜阳市',12,1),(197,'宿州市',12,1),(198,'巢湖市',12,1),(199,'六安市',12,1),(200,'亳州市',12,1),(201,'池州市',12,1),(202,'宣城市',12,1),(203,'福州市',13,1),(204,'厦门市',13,1),(205,'莆田市',13,1),(206,'三明市',13,1),(207,'泉州市',13,1),(208,'漳州市',13,1),(209,'南平市',13,1),(210,'龙岩市',13,1),(211,'宁德市',13,1),(212,'南昌市',14,1),(213,'景德镇市',14,1),(214,'萍乡市',14,1),(215,'九江市',14,1),(216,'新余市',14,1),(217,'鹰潭市',14,1),(218,'赣州市',14,1),(219,'吉安市',14,1),(220,'宜春市',14,1),(221,'抚州市',14,1),(222,'上饶市',14,1),(223,'济南市',15,1),(224,'青岛市',15,1),(225,'淄博市',15,1),(226,'枣庄市',15,1),(227,'东营市',15,1),(228,'烟台市',15,1),(229,'潍坊市',15,1),(230,'济宁市',15,1),(231,'泰安市',15,1),(232,'威海市',15,1),(233,'日照市',15,1),(234,'莱芜市',15,1),(235,'临沂市',15,1),(236,'德州市',15,1),(237,'聊城市',15,1),(238,'滨州市',15,1),(239,'菏泽市',15,1),(240,'郑州市',16,1),(241,'开封市',16,1),(242,'洛阳市',16,1),(243,'平顶山市',16,1),(244,'安阳市',16,1),(245,'鹤壁市',16,1),(246,'新乡市',16,1),(247,'焦作市',16,1),(248,'濮阳市',16,1),(249,'许昌市',16,1),(250,'漯河市',16,1),(251,'三门峡市',16,1),(252,'南阳市',16,1),(253,'商丘市',16,1),(254,'信阳市',16,1),(255,'周口市',16,1),(256,'驻马店市',16,1),(257,'济源市',16,1),(258,'武汉市',17,1),(259,'黄石市',17,1),(260,'十堰市',17,1),(261,'宜昌市',17,1),(262,'襄樊市',17,1),(263,'鄂州市',17,1),(264,'荆门市',17,1),(265,'孝感市',17,1),(266,'荆州市',17,1),(267,'黄冈市',17,1),(268,'咸宁市',17,1),(269,'随州市',17,1),(270,'恩施土家族苗族自治州',17,1),(271,'仙桃市',17,1),(272,'潜江市',17,1),(273,'天门市',17,1),(274,'神农架林区',17,1),(275,'长沙市',18,1),(276,'株洲市',18,1),(277,'湘潭市',18,1),(278,'衡阳市',18,1),(279,'邵阳市',18,1),(280,'岳阳市',18,1),(281,'常德市',18,1),(282,'张家界市',18,1),(283,'益阳市',18,1),(284,'郴州市',18,1),(285,'永州市',18,1),(286,'怀化市',18,1),(287,'娄底市',18,1),(288,'湘西土家族苗族自治州',18,1),(289,'广州市',19,1),(290,'韶关市',19,1),(291,'深圳市',19,1),(292,'珠海市',19,1),(293,'汕头市',19,1),(294,'佛山市',19,1),(295,'江门市',19,1),(296,'湛江市',19,1),(297,'茂名市',19,1),(298,'肇庆市',19,1),(299,'惠州市',19,1),(300,'梅州市',19,1),(301,'汕尾市',19,1),(302,'河源市',19,1),(303,'阳江市',19,1),(304,'清远市',19,1),(305,'东莞市',19,1),(306,'中山市',19,1),(307,'潮州市',19,1),(308,'揭阳市',19,1),(309,'云浮市',19,1),(310,'南宁市',20,1),(311,'柳州市',20,1),(312,'桂林市',20,1),(313,'梧州市',20,1),(314,'北海市',20,1),(315,'防城港市',20,1),(316,'钦州市',20,1),(317,'贵港市',20,1),(318,'玉林市',20,1),(319,'百色市',20,1),(320,'贺州市',20,1),(321,'河池市',20,1),(322,'来宾市',20,1),(323,'崇左市',20,1),(324,'海口市',21,1),(325,'三亚市',21,1),(326,'五指山市',21,1),(327,'琼海市',21,1),(328,'儋州市',21,1),(329,'文昌市',21,1),(330,'万宁市',21,1),(331,'东方市',21,1),(332,'定安县',21,1),(333,'屯昌县',21,1),(334,'澄迈县',21,1),(335,'临高县',21,1),(336,'白沙黎族自治县',21,1),(337,'昌江黎族自治县',21,1),(338,'乐东黎族自治县',21,1),(339,'陵水黎族自治县',21,1),(340,'保亭黎族苗族自治县',21,1),(341,'琼中黎族苗族自治县',21,1),(342,'西沙群岛',21,1),(343,'南沙群岛',21,1),(344,'中沙群岛的岛礁及其海域',21,1),(345,'万州区',22,1),(346,'涪陵区',22,1),(347,'渝中区',22,1),(348,'大渡口区',22,1),(349,'江北区',22,1),(350,'沙坪坝区',22,1),(351,'九龙坡区',22,1),(352,'南岸区',22,1),(353,'北碚区',22,1),(354,'双桥区',22,1),(355,'万盛区',22,1),(356,'渝北区',22,1),(357,'巴南区',22,1),(358,'黔江区',22,1),(359,'长寿区',22,1),(360,'綦江县',22,1),(361,'潼南县',22,1),(362,'铜梁县',22,1),(363,'大足县',22,1),(364,'荣昌县',22,1),(365,'璧山县',22,1),(366,'梁平县',22,1),(367,'城口县',22,1),(368,'丰都县',22,1),(369,'垫江县',22,1),(370,'武隆县',22,1),(371,'忠县',22,1),(372,'开县',22,1),(373,'云阳县',22,1),(374,'奉节县',22,1),(375,'巫山县',22,1),(376,'巫溪县',22,1),(377,'石柱土家族自治县',22,1),(378,'秀山土家族苗族自治县',22,1),(379,'酉阳土家族苗族自治县',22,1),(380,'彭水苗族土家族自治县',22,1),(381,'江津市',22,1),(382,'合川市',22,1),(383,'永川市',22,1),(384,'南川市',22,1),(385,'成都市',23,1),(386,'自贡市',23,1),(387,'攀枝花市',23,1),(388,'泸州市',23,1),(389,'德阳市',23,1),(390,'绵阳市',23,1),(391,'广元市',23,1),(392,'遂宁市',23,1),(393,'内江市',23,1),(394,'乐山市',23,1),(395,'南充市',23,1),(396,'眉山市',23,1),(397,'宜宾市',23,1),(398,'广安市',23,1),(399,'达州市',23,1),(400,'雅安市',23,1),(401,'巴中市',23,1),(402,'资阳市',23,1),(403,'阿坝藏族羌族自治州',23,1),(404,'甘孜藏族自治州',23,1),(405,'凉山彝族自治州',23,1),(406,'贵阳市',24,1),(407,'六盘水市',24,1),(408,'遵义市',24,1),(409,'安顺市',24,1),(410,'铜仁地区',24,1),(411,'黔西南布依族苗族自治州',24,1),(412,'毕节地区',24,1),(413,'黔东南苗族侗族自治州',24,1),(414,'黔南布依族苗族自治州',24,1),(415,'昆明市',25,1),(416,'曲靖市',25,1),(417,'玉溪市',25,1),(418,'保山市',25,1),(419,'昭通市',25,1),(420,'丽江市',25,1),(421,'思茅市',25,1),(422,'临沧市',25,1),(423,'楚雄彝族自治州',25,1),(424,'红河哈尼族彝族自治州',25,1),(425,'文山壮族苗族自治州',25,1),(426,'西双版纳傣族自治州',25,1),(427,'大理白族自治州',25,1),(428,'德宏傣族景颇族自治州',25,1),(429,'怒江傈僳族自治州',25,1),(430,'迪庆藏族自治州',25,1),(431,'拉萨市',26,1),(432,'昌都地区',26,1),(433,'山南地区',26,1),(434,'日喀则地区',26,1),(435,'那曲地区',26,1),(436,'阿里地区',26,1),(437,'林芝地区',26,1),(438,'西安市',27,1),(439,'铜川市',27,1),(440,'宝鸡市',27,1),(441,'咸阳市',27,1),(442,'渭南市',27,1),(443,'延安市',27,1),(444,'汉中市',27,1),(445,'榆林市',27,1),(446,'安康市',27,1),(447,'商洛市',27,1),(448,'兰州市',28,1),(449,'嘉峪关市',28,1),(450,'金昌市',28,1),(451,'白银市',28,1),(452,'天水市',28,1),(453,'武威市',28,1),(454,'张掖市',28,1),(455,'平凉市',28,1),(456,'酒泉市',28,1),(457,'庆阳市',28,1),(458,'定西市',28,1),(459,'陇南市',28,1),(460,'临夏回族自治州',28,1),(461,'甘南藏族自治州',28,1),(462,'西宁市',29,1),(463,'海东地区',29,1),(464,'海北藏族自治州',29,1),(465,'黄南藏族自治州',29,1),(466,'海南藏族自治州',29,1),(467,'果洛藏族自治州',29,1),(468,'玉树藏族自治州',29,1),(469,'海西蒙古族藏族自治州',29,1),(470,'银川市',30,1),(471,'石嘴山市',30,1),(472,'吴忠市',30,1),(473,'固原市',30,1),(474,'中卫市',30,1),(475,'乌鲁木齐市',31,1),(476,'克拉玛依市',31,1),(477,'吐鲁番地区',31,1),(478,'哈密地区',31,1),(479,'昌吉回族自治州',31,1),(480,'博尔塔拉蒙古自治州',31,1),(481,'巴音郭楞蒙古自治州',31,1),(482,'阿克苏地区',31,1),(483,'克孜勒苏柯尔克孜自治州',31,1),(484,'喀什地区',31,1),(485,'和田地区',31,1),(486,'伊犁哈萨克自治州',31,1),(487,'塔城地区',31,1),(488,'阿勒泰地区',31,1),(489,'石河子市',31,1),(490,'阿拉尔市',31,1),(491,'图木舒克市',31,1),(492,'五家渠市',31,1),(493,'台北市',32,1),(494,'高雄市',32,1),(495,'基隆市',32,1),(496,'台中市',32,1),(497,'台南市',32,1),(498,'新竹市',32,1),(499,'嘉义市',32,1);

/*Table structure for table `t_menu` */

DROP TABLE IF EXISTS `t_menu`;

CREATE TABLE `t_menu` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `icon_cls` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `page_cmp_url` varchar(255) DEFAULT NULL,
  `render_level` int(11) DEFAULT NULL,
  `show_index` int(11) DEFAULT NULL,
  `parent_menu` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FK_arxk0dwkhikhfynk2911vegml` (`parent_menu`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8;

/*Data for the table `t_menu` */

insert  into `t_menu`(`id`,`icon_cls`,`name`,`page_cmp_url`,`render_level`,`show_index`,`parent_menu`) values (1,NULL,'订单管理','/sys/order',0,0,NULL),(2,NULL,'系统管理','/sys/yunwei',0,1,NULL),(3,NULL,'订单管理','/toPage.do?destPage=orderList',1,0,1),(8,NULL,'用户管理','/toPage.do?destPage=userList',1,1,2),(9,NULL,'地址库管理','/toPage.do?destPage=commonAddrs',1,2,2),(10,NULL,'系统菜单管理','/toPage.do?destPage=menu',1,3,2),(11,NULL,'数据字典管理','/toPage.do?destPage=code',1,4,2);

/*Table structure for table `t_user` */

DROP TABLE IF EXISTS `t_user`;

CREATE TABLE `t_user` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userId` int(11) DEFAULT NULL COMMENT '用户id',
  `identityCard` varchar(20) DEFAULT NULL COMMENT '身份证',
  `name` varchar(200) NOT NULL COMMENT '用户名',
  `phone` varchar(20) NOT NULL COMMENT '手机号码',
  `email` varchar(50) DEFAULT NULL COMMENT '电子邮箱',
  `password` varchar(100) NOT NULL COMMENT '密码',
  `avatar` varchar(255) DEFAULT NULL COMMENT '头像',
  `smallAvatar` varchar(255) DEFAULT NULL COMMENT '小头像',
  `provinceId` int(11) NOT NULL COMMENT '省份',
  `cityId` int(11) NOT NULL COMMENT '城市',
  `registerTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '注册日期',
  `updateTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '个人资料更新日期',
  `active` int(11) NOT NULL COMMENT '账户状态 1->激活 2-审核 3 -> 禁用',
  `status` int(1) NOT NULL COMMENT '1录入 2配送  100 -> 管理员',
  `addr` varchar(300) DEFAULT NULL COMMENT '地址',
  `clientId` varchar(100) DEFAULT NULL COMMENT '用户登录客户端个推id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=9994106 DEFAULT CHARSET=utf8;

/*Data for the table `t_user` */

insert  into `t_user`(`id`,`userId`,`identityCard`,`name`,`phone`,`email`,`password`,`avatar`,`smallAvatar`,`provinceId`,`cityId`,`registerTime`,`updateTime`,`active`,`status`,`addr`,`clientId`) values (1,1,NULL,'管理员','admin','202cb962ac59075b964b07152d234b70','202cb962ac59075b964b07152d234b70',NULL,NULL,0,0,'2015-06-28 16:52:38','2015-08-04 16:11:55',1,100,NULL,NULL);

/*Table structure for table `t_user_login` */

DROP TABLE IF EXISTS `t_user_login`;

CREATE TABLE `t_user_login` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userId` int(11) NOT NULL COMMENT '主键',
  `tokenId` varchar(50) NOT NULL DEFAULT '' COMMENT '当前登录tokenId',
  `tokenTime` timestamp NULL DEFAULT NULL COMMENT '最后接口时间戳',
  `loginTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '用户登录时间',
  `version` varchar(50) DEFAULT NULL COMMENT '登录客户端版本',
  PRIMARY KEY (`id`,`userId`),
  KEY `tokenId` (`tokenId`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=7578 DEFAULT CHARSET=utf8 COMMENT='用户登录信息表';

/*Data for the table `t_user_login` */

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
